fix hardcoded broker advertising
